{
  "foods": [
    {
      "id": 1,
      "name": "Nasi Goreng",
      "description": "Nasi Goreng is a popular Indonesian fried rice dish. It is made by stir-frying pre-cooked rice with a combination of meats, vegetables, and aromatic spices.",
      "image_url": "lib/assets/images/nasiGoreng.jpg",
      "region": "Java",
      "price": "RP 25.000"
    },
    {
      "id": 2,
      "name": "Rendang",
      "description": "Rendang is a spicy meat dish originating from the Minangkabau ethnic group in Indonesia. It is typically made with beef that is slowly cooked in a rich coconut milk-based sauce with a blend of flavorful spices.",
      "image_url": "lib/assets/images/rendang.jpg",
      "region": "Sumatra",
      "price": "RP 50.000"
    },
    {
      "id": 3,
      "name": "Gado-gado",
      "description": "Gado-gado is a traditional Indonesian salad made with blanched or steamed vegetables, such as cabbage, bean sprouts, and carrots, mixed with tofu, tempeh, and a peanut sauce dressing.",
      "image_url": "lib/assets/images/gadoGado.jpg",
      "region": "Java",
      "price": "RP 20.000"
    },
    {
      "id": 4,
      "name": "Sate Ayam",
      "description": "Sate Ayam, also known as chicken satay, is a popular Indonesian street food. It consists of skewered and grilled chicken marinated in a flavorful mixture of turmeric, garlic, and other spices, served with peanut sauce.",
      "image_url": "lib/assets/images/sateAyam.jpg",
      "region": "Java",
      "price": "RP 15.000 per skewer"
    },
    {
      "id": 5,
      "name": "Bakso",
      "description": "Bakso is a type of Indonesian meatball soup. The meatballs, usually made from a mixture of ground beef and tapioca starch, are served in a flavorful broth with noodles, vegetables, and various condiments.",
      "image_url": "lib/assets/images/bakso.jpg",
      "region": "Java",
      "price": "RP 15.000 per bowl"
    },
    {
      "id": 6,
      "name": "Rujak",
      "description": "Rujak is a traditional Indonesian fruit salad that combines a variety of tropical fruits such as mangoes, pineapples, and papayas, with a sweet and spicy dressing made from palm sugar, tamarind, and chili.",
      "image_url": "lib/assets/images/rujak.jpg",
      "region": "Java",
      "price": "RP 10.000 per plate"
    },
    {
      "id": 7,
      "name": "Soto Ayam",
      "description": "Soto Ayam is a traditional Indonesian chicken soup. It is made with aromatic spices, herbs, shredded chicken, and rice noodles, and is often garnished with fried shallots and fresh lime juice.",
      "image_url": "lib/assets/images/sotoAyam.jpg",
      "region": "Java",
      "price": "RP 20.000"
    },
    {
      "id": 8,
      "name": "Nasi Uduk",
      "description": "Nasi Uduk is a fragrant Indonesian rice dish cooked in coconut milk and spices. It is typically served with various side dishes, such as fried chicken, fried tempeh, and sambal chili sauce.",
      "image_url": "lib/assets/images/nasiUduk.jpg",
      "region": "Java",
      "price": "RP 15.000"
    },
    {
      "id": 9,
      "name": "Martabak",
      "description": "Martabak is a popular Indonesian street food that comes in two varieties: sweet and savory. Sweet martabak is a thick pancake filled with chocolate, cheese, or a combination of both. Savory martabak is a stuffed pancake filled with minced meat, eggs, and vegetables.",
      "image_url": "lib/assets/images/martabak.jpg",
      "region": "Java",
      "price": "RP 25.000"
    },
    {
      "id": 10,
      "name": "Pempek",
      "description": "Pempek is a traditional Indonesian fishcake dish from Palembang. It is made from a mixture of ground fish, tapioca starch, and spices, which is then deep-fried and served with a tangy vinegar-based sauce.",
      "image_url": "lib/assets/images/pempek.jpg",
      "region": "Sumatra",
      "price": "RP 10.000 per piece"
    },
    {
      "id": 11,
      "name": "Nasi Padang",
      "description": "Nasi Padang is a flavorful Indonesian rice dish that originated from the city of Padang. It consists of steamed rice served with an array of side dishes, such as rendang, curries, fried chicken, and various vegetables.",
      "image_url": "lib/assets/images/nasiPadang.jpg",
      "region": "Sumatra",
      "price": "RP 30.000"
    },
    {
      "id": 12,
      "name": "Ketoprak",
      "description": "Ketoprak is a traditional Indonesian dish made with rice vermicelli, tofu, bean sprouts, and a peanut sauce. It is often served as a street food snack or light meal.",
      "image_url": "lib/assets/images/ketoprak.jpg",
      "region": "Java",
      "price": "RP 15.000"
    },
    {
      "id": 13,
      "name": "Soto Betawi",
      "description": "Soto Betawi is a Jakarta-style beef soup. It is made with beef, coconut milk, and a variety of herbs and spices. It is typically served with rice, fried shallots, and emping crackers.",
      "image_url": "lib/assets/images/sotoBetawi.jpg",
      "region": "Java",
      "price": "RP 25.000"
    },
    {
      "id": 14,
      "name": "Pisang Goreng",
      "description": "Pisang Goreng, or fried bananas, are a popular Indonesian snack. Ripe bananas are coated in batter and deep-fried until golden and crispy. They are often enjoyed with a cup of tea or coffee.",
      "image_url": "lib/assets/images/pisangGoreng.jpg",
      "region": "Java",
      "price": "RP 5.000 per piece"
    },
    {
      "id": 15,
      "name": "Nasi Kunyit",
      "description": "Nasi Kunyit, also known as yellow rice, is a traditional Indonesian dish made by cooking rice with turmeric, giving it a vibrant yellow color. It is often served as part of festive meals or special occasions.",
      "image_url": "lib/assets/images/nasiKunyit.jpg",
      "region": "Java",
      "price": "RP 10.000 per portion"
    },
    {
      "id": 16,
      "name": "Kerak Telor",
      "description": "Kerak Telor is a traditional Betawi rice cake made with sticky rice, dried shrimp, grated coconut, and duck eggs. It is cooked on a clay stove and often enjoyed during cultural festivals in Jakarta.",
      "image_url": "lib/assets/images/kerakTelor.jpg",
      "region": "Java",
      "price": "RP 20.000"
    },
    {
      "id": 17,
      "name": "Pecel Lele",
      "description": "Pecel Lele is a popular Indonesian dish consisting of deep-fried catfish served with a spicy peanut sauce, steamed rice, and fresh vegetables. It is commonly found in street food stalls and restaurants.",
      "image_url": "lib/assets/images/pecelLele.jpg",
      "region": "Java",
      "price": "RP 15.000"
    },
    {
      "id": 18,
      "name": "Sambal Goreng Tempe",
      "description": "Sambal Goreng Tempe is a traditional Indonesian dish made with fried tempeh (fermented soybean cake) and a spicy sambal sauce. It is often served as a side dish with rice or as a snack.",
      "image_url": "lib/assets/images/sambalGorengTempe.jpg",
      "region": "Java",
      "price": "RP 10.000"
    },
    {
      "id": 19,
      "name": "Lumpia",
      "description": "Lumpia is a popular Indonesian snack similar to spring rolls. It consists of thin wrappers filled with a mixture of vegetables, meat, and sometimes shrimp. The lumpia is then fried until crispy and served with a dipping sauce.",
      "image_url": "lib/assets/images/lumpia.jpg",
      "region": "Java",
      "price": "RP 10.000 per piece"
    },
    {
      "id": 20,
      "name": "Pindang Ikan",
      "description": "Pindang Ikan is a traditional Indonesian fish soup made with tangy tamarind broth, fish, and a combination of aromatic spices. It is often enjoyed with steamed rice and various side dishes.",
      "image_url": "lib/assets/images/pindangIkan.jpg",
      "region": "Java",
      "price": "RP 30.000"
    },
    {
      "id": 21,
      "name": "Rujak Cingur",
      "description": "Rujak Cingur is a unique Indonesian salad from East Java. It combines a mix of vegetables, fruits, and cow snouts (cingur) with a sweet and savory sauce made from fermented shrimp paste, tamarind, and palm sugar.",
      "image_url": "lib/assets/images/rujakCingur.jpg",
      "region": "Java",
      "price": "RP 20.000"
    }
  ]
}
