{
  "mountains": [
    {
      "id": 1,
      "name": "Puncak Jaya",
      "elevation": 4884,
      "range": "Sudirman Range",
      "region": "Papua",
      "image": "lib/assets/images/puncakJaya.jpg",
      "active": true,
      "tags": ["climbing", "expedition", "glacier"],
      "description": "Puncak Jaya, also known as Carstensz Pyramid, is the highest mountain in Indonesia and Oceania. Located in the remote Papua province, it is a challenging climb with its steep slopes and glacier-covered peaks. The mountain offers breathtaking views and is a popular destination for climbers and mountaineering expeditions."
    },
    {
      "id": 2,
      "name": "Kerinci",
      "elevation": 3805,
      "range": "Barisan Mountains",
      "region": "Sumatra",
      "image": "lib/assets/images/kerinci.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Kerinci is the highest volcano in Indonesia and Southeast Asia. Located in the Barisan Mountains of Sumatra, it is a popular trekking destination. The mountain offers stunning panoramic views, lush rainforests, and a chance to witness its active volcanic activity."
    },
    {
      "id": 3,
      "name": "Rinjani",
      "elevation": 3726,
      "range": "Sunda Volcanic Arc",
      "region": "Lombok",
      "image": "lib/assets/images/rinjani.jpg",
      "active": true,
      "tags": ["trekking", "volcano", "crater lake"],
      "description": "Mount Rinjani is a majestic volcano located on the island of Lombok. It is famous for its challenging treks, stunning landscapes, and the breathtaking Segara Anak crater lake. The climb to the summit offers panoramic views of the surrounding areas, making it a favorite among hikers and nature enthusiasts."
    },
    {
      "id": 4,
      "name": "Semeru",
      "elevation": 3676,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/semeru.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Semeru, located in East Java, is the highest volcano on the island of Java. It is renowned for its challenging trek to the summit and the mesmerizing sight of its constantly erupting crater known as 'Mahameru.' The trek offers beautiful scenery, including lush forests, meadows, and the opportunity to witness volcanic activity."
    },
    {
      "id": 5,
      "name": "Raung",
      "elevation": 3332,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/raung.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Raung is an active stratovolcano located in East Java. It is a challenging and rewarding trekking destination, offering breathtaking views of the surrounding landscapes. The volcano is known for its rugged beauty, steep slopes, and occasional volcanic eruptions."
    },
    {
      "id": 6,
      "name": "Merbabu",
      "elevation": 3142,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/merbabu.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Merbabu, located in Central Java, is a popular trekking mountain known for its scenic beauty and diverse flora and fauna. The mountain offers several trekking routes, with the summit providing stunning views of the surrounding landscapes, including Mount Merapi and the city of Yogyakarta."
    },
    {
      "id": 7,
      "name": "Lawu",
      "elevation": 3265,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/lawu.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Lawu, situated on the border of East Java and Central Java, is a sacred volcano known for its spiritual significance and breathtaking scenery. The mountain offers several trekking trails, leading to its summit where pilgrims and hikers can enjoy panoramic views and visit ancient temples and shrines."
    },
    {
      "id": 8,
      "name": "Sumbing",
      "elevation": 3371,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/sumbing.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Sumbing is an iconic volcano located in Central Java. It is known for its picturesque landscapes, terraced rice fields, and stunning sunrise views from its summit. The climb to the top of Mount Sumbing is a rewarding experience, offering a glimpse into the beauty of Java's natural wonders."
    },
    {
      "id": 9,
      "name": "Slamet",
      "elevation": 3428,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/slamet.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Slamet, located in Central Java, is the highest peak in the Sunda Volcanic Arc. It is a popular trekking destination, offering stunning views, dense forests, and unique flora and fauna. The climb to the summit is challenging but rewarding, allowing adventurers to immerse themselves in the beauty of nature."
    },
    {
      "id": 10,
      "name": "Sindoro",
      "elevation": 3136,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/sindoro.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Sindoro is a stratovolcano located in Central Java. It is known for its scenic beauty, stunning views, and challenging trekking trails. The mountain offers a diverse range of landscapes, including lush forests, rolling hills, and the opportunity to witness magnificent sunrises from its summit."
    },
    {
      "id": 11,
      "name": "Merapi",
      "elevation": 2930,
      "range": "Sunda Volcanic Arc",
      "region": "Java",
      "image": "lib/assets/images/merapi.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Merapi, located near Yogyakarta, is one of the most active volcanoes in Indonesia. It is known for its steep slopes, ever-changing landscapes, and the rich cultural significance it holds for the local communities. Trekking to the summit offers thrilling experiences and panoramic views of the surrounding areas."
    },
    {
      "id": 12,
      "name": "Klabat",
      "elevation": 1995,
      "range": "Sulawesi",
      "region": "North Sulawesi",
      "image": "lib/assets/images/klabat.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Klabat is the highest peak in North Sulawesi, offering breathtaking views and unique trekking experiences. The mountain is known for its diverse flora and fauna, including the endemic Rafflesia flower. The climb to the summit provides panoramic views of the surrounding landscapes, including the nearby Bunaken Marine Park."
    },
    {
      "id": 13,
      "name": "Binaiya",
      "elevation": 3027,
      "range": "Seram Island",
      "region": "Maluku",
      "image": "lib/assets/images/binaiya.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Binaiya, located on Seram Island in the Maluku province, is the highest peak in the Maluku Islands. It offers challenging trekking routes through dense rainforests, picturesque valleys, and rugged terrains. The climb to the summit rewards adventurers with breathtaking views and encounters with endemic wildlife."
    },
    {
      "id": 14,
      "name": "Kelimutu",
      "elevation": 1639,
      "range": "Flores Island",
      "region": "East Nusa Tenggara",
      "image": "lib/assets/images/kelimutu.jpg",
      "active": true,
      "tags": ["trekking", "crater lake"],
      "description": "Mount Kelimutu, located on Flores Island, is renowned for its vibrant crater lakes with ever-changing colors. It offers a unique trekking experience, where visitors can witness the mesmerizing sight of the three lakes—each displaying a different hue. The mountain also provides stunning views of the surrounding landscapes."
    },
    {
      "id": 15,
      "name": "Bukit Raya",
      "elevation": 2278,
      "range": "Schwaner Mountains",
      "region": "Central Kalimantan",
      "image": "lib/assets/images/bukitRaya.jpg",
      "active": true,
      "tags": ["trekking"],
      "description": "Mount Bukit Raya, located in the Schwaner Mountains of Central Kalimantan, offers a pristine and remote trekking experience. It is known for its lush rainforests, diverse wildlife, and untouched natural beauty. The climb to the summit rewards trekkers with panoramic views of the surrounding tropical landscapes."
    },
    {
      "id": 16,
      "name": "Tambora",
      "elevation": 2850,
      "range": "Sunda Volcanic Arc",
      "region": "Sumbawa",
      "image": "lib/assets/images/tambora.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Tambora is an iconic volcano located on the island of Sumbawa. It is famous for its historical eruption in 1815, one of the most powerful volcanic eruptions in recorded history. The climb to the summit offers a glimpse into the volcanic crater and stunning views of the surrounding landscapes."
    },
    {
      "id": 17,
      "name": "Krakatoa",
      "elevation": 813,
      "range": "Sunda Strait",
      "region": "Lampung",
      "image": "lib/assets/images/krakatoa.jpg",
      "active": true,
      "tags": ["volcano", "island"],
      "description": "Krakatoa, also known as Krakatau, is a volcanic island situated in the Sunda Strait between Java and Sumatra. It gained worldwide fame for its catastrophic eruption in 1883. Today, the island offers a unique destination for visitors to witness the volcanic activity, explore the remnants of the past eruption, and enjoy the surrounding marine life."
    },
    {
      "id": 18,
      "name": "Cikuray",
      "elevation": 2821,
      "range": "Sunda Volcanic Arc",
      "region": "West Java",
      "image": "lib/assets/images/cikuray.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Cikuray, located in West Java, is a popular trekking mountain known for its beautiful landscapes and panoramic views. The climb to the summit offers a thrilling adventure through forests, streams, and steep slopes. From the top, trekkers can enjoy breathtaking vistas of West Java's picturesque countryside."
    },
    {
      "id": 19,
      "name": "Ciremai",
      "elevation": 3078,
      "range": "Sunda Volcanic Arc",
      "region": "West Java",
      "image": "lib/assets/images/ciremai.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Ciremai is a majestic stratovolcano situated in West Java. It is a popular destination for trekking enthusiasts, offering diverse landscapes, dense forests, and breathtaking views from its summit. The mountain holds cultural and historical significance and is often visited by pilgrims and hikers alike."
    },
    {
      "id": 20,
      "name": "Patuha",
      "elevation": 2434,
      "range": "Sunda Volcanic Arc",
      "region": "West Java",
      "image": "lib/assets/images/patuha.jpg",
      "active": true,
      "tags": ["trekking", "volcano", "crater lake"],
      "description": "Mount Patuha, located in West Java, is a volcanic complex known for its twin crater lakes—Kawah Putih and Kawah Saat. The mountain offers a unique trekking experience through lush forests and sulfuric landscapes. Visitors can enjoy the beauty of the turquoise lakes and the distinct volcanic phenomena."
    },
    {
      "id": 21,
      "name": "Agung",
      "elevation": 3142,
      "range": "Sunda Volcanic Arc",
      "region": "Bali",
      "image": "lib/assets/images/agung.jpg",
      "active": true,
      "tags": ["trekking", "volcano"],
      "description": "Mount Agung, located in Bali, is the highest volcano on the island and is considered sacred by the Balinese people. It offers a challenging trekking experience, breathtaking sunrise views, and a chance to explore the spiritual temples and shrines that adorn its slopes."
    }
  ]
}
